app/Validation/IsCurrentPasswordCorrect.php

    public function check_current_password($password): bool
    {
        $password = trim($password);
        $user_id  = CIAuth::id();
        $user     = new User();
        $user_info = $user->asObject()->where('id',$user_id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1