app/Helpers/CIFunctions_helper.php

    function get_user(){
        if (CIAuth::check()) {
            $user = new User();
            return $user->asObject()->where('id',CIAuth::id())->first();
---
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1

    function get_settings(){
            $settings = new Settings();
            $settings_data = $settings->asObject()->first();
---
SELECT *
FROM `settings`
 LIMIT 1