app/Controllers/AdminController.php

SELECT *
FROM `categories`
---
    public function getParentCategories()
    {
        $request = \Config\Services::request();

        if ($request->isAJAX()) {

            $id = $request->getVar('parent_category_id');
            $options = '<option value="0">Uncategorized</option>';
            $category = new Category();
            $parent_categories = $category->findAll();

INSERT INTO `sub_categories` (`name`, `parent_cat`, `slug`, `description`) VALUES ('rtwrqeq', '3', 'rtwrqeq', 'sadasdad')
---
    public function addSubCategory()
    {
        $request = \Config\Services::request();

        if ($request->isAJAX()) {
            $validation = \Config\Services::validation();


            $this->validate([
                'subcategory_name'=> [
                    'rules'=>'required|is_unique[sub_categories.name]',
                    'errors'=>[
                        'required'=>'Introduce una subcategoria',
                        'is_unique'=>'Ya existe esta subcategoria',
                    ],
                ],
            ]);

            if ($validation->run()=== FALSE ) {
                $errors = $validation->getErrors();
                return $this->response->setJSON(['status'=>0,'token'=>csrf_hash(),'error'=>$errors]);
            } else {
                $subcategory = new SubCategory();
                $subcategory_name = $request->getVar('subcategory_name');
                $subcategory_description = $request->getVar('description');
                $subcategory_parent_category = $request->getVar('parent_cat');
                $subcategory_slug = SlugService::model(SubCategory::class)->make($subcategory_name);

                $save = $subcategory->save([
                    'name'=>$subcategory_name,
                    'parent_cat'=>$subcategory_parent_category,
                    'slug'=>$subcategory_slug,
                    'description'=>$subcategory_description,
                ]);