app/Controllers/AdminController.php

SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1
---
    public function updateProfilePicture()
    {
        $request   = \Config\Services::request();
        $user_id   = CIAuth::id();
        $user      = new User();
        $user_info = $user->asObject()->where('id',$user_id)->first();

        $path         = 'img/';
        $file         = $request->getFile('user_profile_file');
        $old_picture  = $user_info->picture;
        $new_filename = 'UIMG_'.$user_id.$file->getRandomName();

        /*if ($file->move($path,$new_filename)) {
            if ($old_picture != null && file_exists($path.$old_picture)) {
                unlink($path.$old_picture);
            }
            $user->where('id',$user_info->id)->set(['picture'=>$new_filename])->update();

            echo json_encode(['status'=>1,'msg'=>'Done!, Your profile picture has been successfully update.']);
        } else {
            echo json_encode(['status'=>0,'msg'=>'Something went wrong.']);
        }*/

        //Manipulacion de la Imagen
        $upload_image = \Config\Services::image()->withFile($file)->resize(450,450,true,'height')->save($path.$new_filename);

        if ($upload_image) {
            if ($old_picture != null && file_exists($path.$new_filename)) {
                unlink($path.$old_picture);
            }
            $user->where('id',$user_info->id)->set(['picture'=>$new_filename])->update();

UPDATE `users` SET `password` = '$2y$10$5IVodM2SvXHF37dly00qrO1rOfABDnpe65fa/CHzdubmNtmj0VbsW'
WHERE `id` = '1'
---

            //     return $this->response->setJSON(['status'=>1,'token'=>csrf_hash(),'msg'=>'Good']);
            //     //actualizando user(admin) password in DB
                $user->where('id',$user_info->id)->set(['password'=>Hash::make($request->getVar('new_password'))])->update();

UPDATE `settings` SET `blog_logo` = 'Servicios_electricos1712204852_309c5dffdcc547d4737d.png'
WHERE `id` = '1'
---
    public function updateBlogLogo()
    {
        $request = \Config\Services::request();

        if ($request->isAJAX()) {
            $settings = new Settings;
            $path = 'img/logo/';

            $file = $request->getFile('blog_logo');
            $settings_data = $settings->asObject()->first();
            $old_blog_logo = $settings_data->blog_logo;
            $new_filename = 'Servicios_electricos'.$file->getRandomName();

            if ($file->move($path, $new_filename)) {
                if ($old_blog_logo != null && file_exists($path.$old_blog_logo) ) {
                    unlink($path.$old_blog_logo);
                }
                $update = $settings->where('id',$settings_data->id)->set(['blog_logo'=>$new_filename])->update();

SELECT *
FROM `social_media`
 LIMIT 1
UPDATE `social_media` SET `facebook_url` = 'https://facebook.com/blog_page_url', `twitter_url` = 'https://twitter.com/blog_page_url', `instagram_url` = 'https://instagram.com/blog_page_url', `youtube_url` = 'https://youtube.com/blog_page_url', `whatsapp_url` = 'https://whatsapp.com/blog_page_url', `linkedin_url` = 'https://linkedin.com/blog_page_url'
WHERE `id` = '1'
---
                return $this->response->setJSON(['status'=>0, 'token'=>csrf_hash(), 'error'=>$errors]);
            } else {
                $social_media = new SocialMedia();
                $social_media_id=$social_media->asObject()->first()->id;
                $update = $social_media->where('id',$social_media_id)->set([
                    'facebook_url'=>$request->getVar('facebook_url'),
                    'twitter_url'=>$request->getVar('twitter_url'),
                    'instagram_url'=>$request->getVar('instagram_url'),
                    'youtube_url'=>$request->getVar('youtube_url'),
                    'whatsapp_url'=>$request->getVar('whatsapp_url'),
                    'linkedin_url'=>$request->getVar('linkedin_url'),
                ])->update();

SELECT *
FROM `posts`
WHERE `posts`.`id` = 1
SELECT *
FROM `sub_categories`
WHERE `sub_categories`.`id` = '3'
SELECT *
FROM `sub_categories`
---
    public function getPosts()
    {
        //DB Details
        $dbDetails = array(
            "host"=>$this->db->hostname,
            "user"=>$this->db->username,
            "pass"=>$this->db->password,
            "db"  =>$this->db->database
        );
        $table = "posts";
        $primaryKey = "id";
        $columns = array(
            array(
                "db"=>"id",
                "dt"=>0
            ),
            array(
                "db"=>"id",
                "dt"=>1,
                "formatter"=>function($d,$row){
                    $post = new Post();
                    $image = $post->asObject()->find($row['id'])->featured_image;
                    return "<img src='/img/posts/thumb_$image' class='img-thumbnail' style='max-width:70px' >";
                }
            ),
            array(
                "db"=>"title",
                "dt"=>2
            ),
            array(
                "db"=>"id",
                "dt"=>3,
                "formatter"=>function($d,$row){
                    $post = new Post();
                    $category_id = $post->asObject()->find($row['id'])->category_id;
                    $subcategory = new SubCategory();
                    $category_name =  $subcategory->asObject()->find($category_id)->name;

                    return $category_name;
                }
            ),

SELECT *
FROM `posts`
WHERE `posts`.`id` = '1'
---
                "dt"=>4,
                "formatter"=>function($d,$row){
                    $post = new Post();
                    $visibility = $post->asObject()->find($row['id'])->visibility;